#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @File  : config.py
# @Author: Lmm
# @Date  : 2017-08-10
# @Desc  :四省app接口配置文件

#数据库缓存文件夹设置start----------------------------------------------------


#数据库配置start---------------------------------------------------------------
HOST, USER, PASSWD, DB, PORT = '127.0.0.1', 'root', '123456', 'test', 3306
#数据库配置end ----------------------------------------------------------------

#日志文件路径start-------------------------------------------------------------
#log_path = './Public/Python'
log_path = '.'
#日志文件路径end---------------------------------------------------------------

#企业控股情况start-------------------------------------------------------------
holding = {
"1":"国有控股",
"2":"集体控股",
"3":"私人控股",
"4":"港澳台控股",
"5":"外商控股",
"6":"其他"
}
#企业控股情况end---------------------------------------------------------------


#年报公示状态start-------------------------------------------------------------
public_status = {
"1":"已公示",
"2":"未公示",
"3":"未公示"
}

#年报公示状态end---------------------------------------------------------------


#公司类型start-----------------------------------------------------------------
company_type ={
"1":"有限责任公司、股份有限责任公司（非私营企业）",
"2":"非公司企业法人、合伙企业、个人独资企业、非法人中外合作企业（非私营企业）",
"3":"非公司企业法人、合伙企业、个人独资企业、非法人中外合作企业（非私营企业）",
"4":"个体工商户",
"5":"农民专业合作社",
"6":"有限责任公司、股份有限责任公司（私营企业）",
"7":"非公司企业法人、合伙企业、个人独资企业（私营企业）",
"8":"分支机构、内资非法人企业（私营企业）"
}
#公司类型end-------------------------------------------------------------------


#党组织建制类型start-----------------------------------------------------------
party_type ={
"1":"党委" ,
"2":"党总支",
"3":"党支部",
"4":"未成立党组织"
}

#党组织建制类型end------------------------------------------------------------


#省份代号对应start -----------------------------------------------------------
province = {
    "10": "BEJ",
    "11": "BEJ",
    "12": "TJN",
    "13": "HEB",
    "14": "SXI",
    "15": "NMG",
    "21": "LNG",
    "22": "JLN",
    "23": "HLJ",
    "31": "SHH",
    "32": "JSU",
    "33": "ZHJ",
    "34": "ANH",
    "35": "FUJ",
    "36": "JXI",
    "37": "SHD",
    "41": "HEN",
    "42": "HUB",
    "43": "HUN",
    "44": "GAD",
    "45": "GXI",
    "46": "HAN",
    "50": "CHQ",
    "51": "SCH",
    "52": "GZH",
    "53": "YUN",
    "54": "XIZ",
    "61": "SHX",
    "62": "GSU",
    "63": "QNH",
    "64": "NXA",
    "65": "XNJ"
}
#省份代号对应end------------------------------------------------------------------

#APP接口各部分链接start---------------------------------------------------------------------------------

#拿列表链接
url_list = {
    'SHH':"http://sh.gsxt.gov.cn/notice/ws/data/ent_info_list/{0}/1/50",
    'HEB':"http://he.gsxt.gov.cn/notice/ws/data/ent_info_list/{0}/1/50",
    'SCH':'http://sc.gsxt.gov.cn/notice/ws/data/ent_info_list/{0}/1/50',
    'YUN':'http://yn.gsxt.gov.cn/notice/ws/data/ent_info_list/{0}/1/50'
}
#拿详情链接
detail_list = {
    'SHH':"http://sh.gsxt.gov.cn/notice/ws/data/ent_info/{0}",
    'HEB':'http://he.gsxt.gov.cn/notice/ws/data/ent_info/{0}',
    'SCH':'http://sc.gsxt.gov.cn/notice/ws/data/ent_info/{0}',
    'YUN':'http://yn.gsxt.gov.cn/notice/ws/data/ent_info/{0}'
}
#年报链接
report_list = {
    'SHH':'http://sh.gsxt.gov.cn/notice/ws/data/ent_annlBasic/{0}',
    'HEB':'http://he.gsxt.gov.cn/notice/ws/data/ent_annlBasic/{0}',
    'SCH':'http://sc.gsxt.gov.cn/notice/ws/data/ent_annlBasic/{0}',
    'YUN':'http://yn.gsxt.gov.cn/notice/ws/data/ent_annlBasic/{0}'
}
#App接口各部分链接end---------------------------------------------------------------------------------